Repository: adiyazid/flutter_quranirab
Catalog: lib/l10n/app_*.arb
Languages: ms

# helloWorld
source: Peace be Upon You
ms: Salam Sejahtera ke atas Kamu

source: Login to QuranIrab
ms: Log masuk ke QuranIrab

source: Password
ms: Kata Laluan

source: Login
ms: Log Masuk

source: Forgot Password?
ms: Terlupa kata laluan?

# dontHaveAcc
source: Don't have account?
ms: Tiada akaun?

source: Email
ms: Emel

source: Sign Up
ms: Daftar Masuk

source: Register for QuranIrab
ms: Daftar untuk QuranIrab

source: Welcome to QuranIrab Official Website
ms: Selamat Datang ke Laman Web Rasmi QuranIrab

source: First Name
ms: Nama Pertama

source: Last Name
ms: Nama Akhir

# confirmPass
source: Confirm Password
ms: Tulis Semula Kata Laluan

# iAgreeTermCondition
source: I accept the terms and conditions and I have read the privacy policy
ms: Saya menerima terma dan syarat dan saya telah membaca dasar privasi

source: Login Success
ms: Log Masuk Berjaya

# newAccCreated
source: New Account Created
ms: Akaun Berjaya Didaftarkan

# fillAllField
source: Please Fill All Fields
ms: Sila Isi Semua Maklumat

# passwordError
source: Password Did Not Match. Please Insert Again
ms: Kata Laluan Tidak Sepadan. Sila Cuba Lagi

# termConditionError
source: Please Agree with Terms and Condition Before Proceed
ms: Sila Pastikan Terma dan Syarat Telah Dipersetujui Sebelum Mendaftar

# emailError
source: This Email Address is Badly Formatted
ms: Alamat Emel Ini Tidak Mengikut Format Asas Emel

# passwordLengthError
source: Password Should Be at Least 6 Characters
ms: Panjang kata laluan sekurang-kurangnya 6 karakter

# duplicateEmail
source: The Email Address is Already in Use by Another Account.
ms: Alamat Emel ini Telah Digunakan. Sila Cuba Emel yang Lain.

source: Bookmark
ms: Penanda Buku

# emptyBookmark
source: You do not have any bookmark yet
ms: Anda tiada penanda buku lagi

source: Language
ms: Bahasa

source: Search
ms: Carian

# popularSearch
source: Popular Searches
ms: Carian Popular

# setting
source: Settings
ms: Tetapan

source: Theme
ms: Tema

source: Font Size
ms: Saiz Huruf

source: Light Mode
ms: Mod Cerah

source: Dark Mode
ms: Mod Gelap

source: Home
ms: Laman Utama

source: About Us
ms: Tentang Kami

source: User Profile
ms: Profil Pengguna

source: Privacy
ms: Keselamatan

source: Feedback
ms: Maklum Balas

source: Help
ms: Bantuan

source: Leaderboard
ms: Carta Kedudukan

source: Logout
ms: Log Keluar

source: Current Password
ms: Kata Laluan Semasa

source: New Password
ms: Kata Laluan Baharu

source: Save Changes
ms: Simpan Perubahan

# passwordSuccess
source: Password successfully updated!
ms: Kata laluan berjaya diubah!

# profileSuccess
source: Profile successfully updated!
ms: Profil berjaya diubah!

# imageSuccess
source: Profile Images successfully updated!
ms: Gambar profil berjaya diubah!

# permissionError
source: Permission not granted
ms: Kebenaran tidak disahkan

# noFile
source: No file selected
ms: Tiada fail yang dipilih

source: No Changes
ms: Tiada Perubahan

source: Translations
ms: Terjemahan

source: Reading
ms: Membaca

source: Take a Quiz
ms: Ambil kuiz

# prevPage
source: Previous Page
ms: Muka Surat Sebelumnya

source: Beginning Surah
ms: Permulaan Surah

source: Next Page
ms: Muka Surat Seterusnya

source: Items
ms: benda

# wordDetail
source: Detail for
ms: Maklumat untuk

source: Start the Quiz
ms: Mulakan Kuiz

source: Back
ms: Kembali

source: Next
ms: Seterusnya

source: Question
ms: Soalan

source: Word Type
ms: Jenis Perkataan

source: Sentence
ms: Ayat

source: See Result
ms: Lihat Keputusan

# pleaseAnswerQuestion
source: Please answer the questions
ms: Sila jawab soalan berikut

# haveAccSignIn
source: Have account? Sign in
ms: Sudah Ada Akaun? Log Masuk

# featureTranslation
source: Press translation tab to read translation
ms: Tekan tab terjemahan untuk membaca terjemahan

source: Reading Aya
ms: Membaca Ayat

# swipeHorizontal
source: Swipe horizontal to display overflow aya
ms: Seret mendatar untuk melihat ayat yang terlebih panjang

# wordsDetail
source: Word Details
ms: Maklumat Huruf

# pressEach
source: Press each word to display its details
ms: Tekan setiap huruf untuk melihat maklumatnya

source: Customization
ms: Pengubahsuaian

# clickTo
source: Click to change font size and theme
ms: Tekan untuk ubah saiz huruf dan tema

# clickToDisplay
source: Click to display other translation languages
ms: Tekan untuk melihat terjemahan bahasa lain
